tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "git"
brew "htop"
brew "imageoptim-cli"
brew "jq"
brew "lua"
brew "luarocks"
brew "neovim"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "tree"
brew "heroku/brew/heroku"
cask "1password"
cask "alfred"
cask "dash"
cask "docker"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "godot"
cask "gpg-suite"
cask "imageoptim"
cask "mjolnir"
cask "slack"
cask "spotify"
cask "spotify-now-playing"
cask "visual-studio-code"
cask "zoomus"