tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Cross-platform make
brew "cmake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Utility that creates projects from templates
brew "cookiecutter"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for managing dock items
brew "dockutil"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# The open-source database for the realtime web
brew "rethinkdb", restart_service: true
# The Rust toolchain installer
brew "rustup-init"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Clean up files in directories based on their age
brew "tmpreaper"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# General-purpose lossless data-compression library
brew "zlib"
# GitHub CLI
brew "github/gh/gh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "dash"
cask "docker"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "google-backup-and-sync"
cask "gpg-suite"
cask "imageoptim"
cask "miniconda"
cask "mjolnir"
cask "mongodb-compass"
cask "postgres"
cask "postico"
cask "signal"
cask "slack"
cask "spotify"
cask "spotify-now-playing"
cask "visual-studio-code"
cask "zoomus"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "Final Cut Pro", id: 424389933
mas "Logic Pro X", id: 634148309
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835