tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "rigellute/tap"
cask "adoptopenjdk8"
# Software library to render fonts
brew "freetype"
# GNU database manager
brew "gdbm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Cross-platform make
brew "cmake"
# Utility that creates projects from templates
brew "cookiecutter"
# Message bus system, providing inter-application communication
brew "dbus", restart_service: true
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for managing dock items
brew "dockutil"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Web and API based SMTP testing tool
brew "mailhog", restart_service: true
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# The open-source database for the realtime web
brew "rethinkdb", restart_service: true
# The Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Style Framework for The Terminal
brew "shml"
# Tool to build, change, and version infrastructure
brew "terraform"
# Instant terminal sharing
brew "tmate"
# Clean up files in directories based on their age
brew "tmpreaper"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# General-purpose lossless data-compression library
brew "zlib"
# GitHub CLI
brew "github/gh/gh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "dash"
cask "discord"
cask "docker"
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "gpg-suite"
cask "google-chrome"
cask "imageoptim"
cask "insomnia"
cask "java"
cask "logitech-camera-settings"
cask "miniconda"
cask "mjolnir"
cask "mongodb-compass"
cask "postgres"
cask "postico"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoomus"