tap "aws/tap"
tap "buildpacks/tap"
tap "crunchydata/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "localstack/tap"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "render-oss/render"
tap "tidbyt/tidbyt"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Language Server for Ansible Files
brew "ansible-language-server"
# General-purpose data compression with high compression ratio
brew "xz"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Atmel AVR MCU programmer
brew "avrdude"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Development kit for the Java programming language
brew "openjdk"
# Language Server (LSP) for Clojure
brew "clojure-lsp"
# Cross-platform make
brew "cmake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tools for browsing and manipulating docker registries
brew "docker-ls"
# .NET Core
brew "dotnet"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# GNU Emacs text editor
brew "emacs"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Multi-format archive and compression library
brew "libarchive"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Language Server for Fortran
brew "fortran-language-server"
# Terminal JSON viewer
brew "fx"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Integration point for ghcide and haskell-ide-engine. One IDE to rule them all
brew "haskell-language-server"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Manage your Java environment
brew "jenv"
# Fast, Dynamic Programming Language
brew "julia"
# Intelligent Kotlin support for any editor/IDE using the Language Server Protocol
brew "kotlin-language-server"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# CLI client for interacting with LXD
brew "lxc"
# Language Server Protocol for Markdown
brew "marksman"
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# GDI+-compatible API on non-Windows operating systems
brew "mono-libgdiplus"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General purpose programming language in the ML family
brew "ocaml"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Manage compile and link flags for libraries
brew "pkg-config"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Language Server Protocol server for PureScript
brew "purescript-language-server"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Tool Command Language
brew "tcl-tk"
# Software environment for statistical computing
brew "r"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Reversible directory-local environment variable manipulations
brew "shadowenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Ruby language server
brew "solargraph"
# Spotify daemon
brew "spotifyd", restart_service: true
# Language Server for SQL
brew "sql-language-server"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform Language Server
brew "terraform-ls"
# Language Server Protocol for Terraform
brew "terraform-lsp"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Code Intelligence for Vala & Genie
brew "vala-language-server"
# Image processing library
brew "vips"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Language Server for Zig
brew "zls"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# CLI for Crunchy Bridge
brew "crunchydata/brew/cb"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# GNU Binutils for the AVR target
brew "osx-cross/avr/avr-binutils"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Launch your next project into the cloud
brew "render-oss/render/render"
# App runtime and UX toolkit for pixel-based apps.
brew "tidbyt/tidbyt/pixlet"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Tools for building Android applications
cask "android-studio"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox-developer-edition"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# GPU-based terminal emulator
cask "kitty"
# Cable-free audio router
cask "loopback"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# App wrapper for Postgres
cask "postgres-unofficial"
# GUI client for PostgreSQL databases
cask "postico"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Mesh VPN based on Wireguard
cask "tailscale"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
